{
  "url": "https://www.paolomascatelli.com/contact",
  "title": "Paolo Mascatelli",
  "bodyText": "NAV\nSKIP TO CONTENT\nPM\nPaolo Mascatelli\n\nCreative Director · Brand Strategist · Visual Storyteller\n\n10+ years orchestrating luxury brand experiences through photography, video production, and strategic creative direction. From Disney features to boutique brand launches.\n\n📧 Email Me\n📄 View Full Resume\nFreelance Work\nAiPhlo Inquiries\n📧\nPersonal Projects\n\nPhotography, creative direction, brand strategy, and freelance opportunities\n\npaolomascatelli@gmail.com\n📱\nDirect Line\n\nQuick questions or time-sensitive projects\n\n+1 619 433 8917\n🌐\nPortfolio\n\nView my photography and creative work\n\npaolomascatelli.com\nResume & Experience\n⬇ Download PDF\n📄 View Cover Letter\n▼\n\nDear Hiring Manager,\n\nWith over a decade of creative and strategic experience across photography, video production, branding, and marketing, I bring a rare blend of hands-on production expertise and conceptual vision. My background spans everything from feature film and fashion photography to startup brand development and AI-enhanced marketing strategy — all anchored by a deep understanding of storytelling and audience connection.\n\nAs Creative Director at AiPhlo (formerly Digital Graffiti Media Co.), I've led full-scale brand initiatives integrating design, social media management, SEO/SEM/MPO strategy, and scalable content production. I've developed campaigns for both emerging and established brands, directing creative teams, overseeing video and still production, and delivering organic engagement and measurable growth.\n\nI've worked across every phase of content development: concepting, shooting, editing, and managing rollout strategy. Beyond production, I bring an advanced awareness of modern marketing ecosystems — including AI-driven tools, data-integrated campaigns, and algorithmic audience mapping.\n\nWhat drives me most is crafting meaningful, resonant visual stories — whether it's a brand launch, a digital campaign, or a cinematic shoot. I'm at my best when I can unite art and analytics to create content that looks beautiful and performs effectively.\n\nI'd love the opportunity to bring this mix of creativity, leadership, and strategy to your team.\n\nWarm regards,\nPaolo Mascatelli\n\nProfessional Summary\n\n10+ years of professional work experience across multiple media forms (Photo/Video, Design) with features including Walt Disney's \"Enchanted.\" Executive Producer and writer credits, degree in Advertising with hands-on marketing, production skills, conceptual strategic planning, technical strategy & brand management.\n\nWork Experience\nOwner / Creative Director\n\nAiPhlo (formerly Digital Graffiti Media Co.) · Venice, CA\n\nJanuary 2017 – Present\n\nSocial Media & P.R. Rooted Creative Marketing. Brand Identity, Design, Social Media Management, Video Production. Curated media spaces delivering 100% organic consumer audiences. Content & Engagement Strategies, Account Management (SEO, SEM, MPO), Computer learning algorithmic software, Scalable Production.\n\nArt Director, Illustrator & P.A.\n\nPI&C & CY&N · New York, NY\n\nJune 2016 – July 2017\n\nPartnered with writers on creative briefs for broadcast, content, integrated and digital advertising for Alitalia, Nutella, Match.com and Wyndham Resorts. Won Top Dog Award for Square Pay.\n\nDirector of Photography & Production\n\nPaolo Mascatelli Photography · Los Angeles, CA\n\nJanuary 2010 – December 2015\n\nSpecializing in portraiture, fashion, fine art and commercial photography. Creation / product design.\n\nE.P., Writer\n\nMotion Picture Industry Featured · New York, NY\n\nJanuary 2006 – December 2011\n\nFeatured in documentary Mad Hot Ballroom, Principal Dancer in Walt Disney's Enchanted, Executive Producer and Co-writer of The Cynical Life.\n\nCore Skills\nCreative Direction\nPhotography\nVideography\nAdobe Creative Suite\nSEO/SEM\nBrand Strategy\nSocial Media\nContent Strategy\nProduction\nUX/UI Design\nAI Integration\n\n© 2025 Paolo Mascatelli · Available for freelance projects and creative direction opportunities\n\nVenice, CA 90291 · Authorized to work in the US · Willing to relocate\n\nALL RIGHTS RESERVED\n\nNOT FOR PUBLIC USE\n\nStay in the loop\n\nSign up with your email address to receive news and updates.\n\n SIGN UP\nL.A.  NYC  MIAMI\n\ncontact us",
  "headings": [
    "Paolo Mascatelli",
    "Personal Projects",
    "Direct Line",
    "Portfolio",
    "Product Inquiries",
    "Agency Partnerships",
    "Technical Support",
    "Resume & Experience",
    "Professional Summary",
    "Work Experience",
    "Core Skills",
    "Stay in the loop",
    "L.A.  NYC  MIAMI"
  ],
  "forms": 1,
  "codeBlocks": 3
}